
export const ChangeErrorMsg = (code) => {
    var errDic = {
        0: '图片识别失败，请换一张',
        101: '缺少必填的参数，出现这个情况还可能是et的值和实际加密方式不对应',
        102: '不支持的语言类型',
        103: '翻译文本过长',
        104: '不支持的API类型',
        105: '不支持的签名类型',
        106: '不支持的响应类型',
        107: '不支持的传输加密类型',
        108: 'appKey无效，注册账号， 登录后台创建应用和实例并完成绑定， 可获得应用ID和密钥等信息，其中应用ID就是appKey（ 注意不是应用密钥',
        109: 'batchLog格式不正确',
        110: '无相关服务的有效实例',
        111: '开发者账号无效，可能是账号为欠费状态',
        201:	'解密失败，可能为DES, BASE64, URLDecode的错误',
        202:	'签名检验失败',
        203:	'访问IP地址不在可访问IP列表',
        301:	'辞典查询失败',
        302:	'翻译查询失败',
        303:	'服务端的其它异常',
        401:	'账户已经欠费停',
        1001:	'无效的OCR类型',
        1002:	'不支持的OCR image类型',
        1003:	'不支持的OCR Language类型',
        1004:	'识别图片过大',
        1201:	'图片base64解密失败',
        1301:	'OCR段落识别失败',
        1411:	'访问频率受限',
        1412:	'超过最大识别字节数'
    }

    return errDic[code];
}